nxp-mcuxpresso/mcux-sdk/boards/frdmmcxc041/project_template/pin_mux.c
/*
 * Copyright 2024 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v15.0
processor: MCXC041
package_id: MCXC041VFK
mcu_data: ksdk2_0
processor_version: 0.16.1
board: FRDM-MCXC041
expansion_headers:
- id: micro_bus
  name: mikroBUS(TM)
  connectors:
  - id: C1
    name: J6
    pins:
    - {id: 1, pin_num: '15', pin_signal: ADC0_SE3/PTA8/I2C0_SCL/SPI0_MOSI}
    - {id: 2, pin_num: '9', pin_signal: PTB10/TPM0_CH1/SPI0_SS_b}
    - {id: 3, pin_num: '7', pin_signal: PTA5/RTC_CLKIN/TPM0_CH1/SPI0_SS_b}
    - {id: 4, pin_num: '12', pin_signal: ADC0_SE9/PTB0/IRQ_5/LLWU_P4/EXTRG_IN/SPI0_SCK/I2C0_SCL}
    - {id: 5, pin_num: '8', pin_signal: PTA6/TPM0_CH0/SPI0_MISO}
    - {id: 6, pin_num: '11', pin_signal: PTA7/IRQ_4/SPI0_MISO/SPI0_MOSI}
  - id: C2
    name: J5
    pins:
    - {id: 1, pin_num: '21', pin_signal: PTB13/CLKOUT32K/TPM1_CH1/RTC_CLKOUT}
    - {id: 2, pin_num: '10', pin_signal: PTB11/TPM0_CH0/SPI0_MISO}
    - {id: 3, pin_num: '14', pin_signal: VREF_OUT/CMP0_IN5/PTB2/IRQ_7/LPUART0_RX/LPUART0_TX}
    - {id: 4, pin_num: '13', pin_signal: ADC0_SE8/CMP0_IN3/PTB1/IRQ_6/LPUART0_TX/LPUART0_RX/I2C0_SDA}
    - {id: 5, pin_num: '17', pin_signal: PTB3/IRQ_10/I2C0_SCL/LPUART0_TX}
    - {id: 6, pin_num: '18', pin_signal: PTB4/IRQ_11/I2C0_SDA/LPUART0_RX}
- id: pmod
  name: Pmod(TM)
  connectors:
  - id: C1
    name: J7
    pins:
    - {id: 1, pin_num: '7', pin_signal: PTA5/RTC_CLKIN/TPM0_CH1/SPI0_SS_b}
    - {id: 2, pin_num: '1', pin_signal: PTB6/IRQ_2/LPTMR0_ALT3/TPM1_CH1/TPM_CLKIN1}
    - {id: 3, pin_num: '11', pin_signal: PTA7/IRQ_4/SPI0_MISO/SPI0_MOSI}
    - {id: 4, pin_num: '2', pin_signal: PTB7/IRQ_3/TPM1_CH0}
    - {id: 5, pin_num: '8', pin_signal: PTA6/TPM0_CH0/SPI0_MISO}
    - {id: 6, pin_num: '17', pin_signal: PTB3/IRQ_10/I2C0_SCL/LPUART0_TX}
    - {id: 7, pin_num: '12', pin_signal: ADC0_SE9/PTB0/IRQ_5/LLWU_P4/EXTRG_IN/SPI0_SCK/I2C0_SCL}
    - {id: 8, pin_num: '18', pin_signal: PTB4/IRQ_11/I2C0_SDA/LPUART0_RX}
- id: frdm_arduino
  name: LPCXpresso V3 (Arduino compatible)
  connectors:
  - {id: C1, name: J3}
  - id: C2
    name: J2
    pins:
    - {id: 2, pin_num: '9', pin_signal: PTB10/TPM0_CH1/SPI0_SS_b}
    - {id: 4, pin_num: '10', pin_signal: PTB11/TPM0_CH0/SPI0_MISO}
    - {id: 6, name: A2, pin_num: '7', pin_signal: PTA5/RTC_CLKIN/TPM0_CH1/SPI0_SS_b}
    - {id: 8, pin_num: '11', pin_signal: PTA7/IRQ_4/SPI0_MISO/SPI0_MOSI}
    - {id: 10, pin_num: '8', pin_signal: PTA6/TPM0_CH0/SPI0_MISO}
    - {id: 12, pin_num: '12', pin_signal: ADC0_SE9/PTB0/IRQ_5/LLWU_P4/EXTRG_IN/SPI0_SCK/I2C0_SCL}
    - {id: 18, pin_num: '18', pin_signal: PTB4/IRQ_11/I2C0_SDA/LPUART0_RX}
    - {id: 20, pin_num: '17', pin_signal: PTB3/IRQ_10/I2C0_SCL/LPUART0_TX}
  - id: C3
    name: J1
    pins:
    - {id: 2, pin_num: '14', pin_signal: VREF_OUT/CMP0_IN5/PTB2/IRQ_7/LPUART0_RX/LPUART0_TX}
    - {id: 4, pin_num: '13', pin_signal: ADC0_SE8/CMP0_IN3/PTB1/IRQ_6/LPUART0_TX/LPUART0_RX/I2C0_SDA}
    - {id: 8, pin_num: '1', pin_signal: PTB6/IRQ_2/LPTMR0_ALT3/TPM1_CH1/TPM_CLKIN1}
    - {id: 12, pin_num: '2', pin_signal: PTB7/IRQ_3/TPM1_CH0}
    - {id: 14, pin_num: '19', pin_signal: ADC0_SE1/CMP0_IN1/PTB5/IRQ_12/TPM1_CH1/NMI_b}
    - {id: 16, pin_num: '22', pin_signal: ADC0_SE15/CMP0_IN2/PTA0/IRQ_0/LLWU_P7/TPM1_CH0/SWD_CLK}
  - id: C4
    name: J4
    pins:
    - {id: 2, pin_num: '16', pin_signal: ADC0_SE2/PTA9/I2C0_SDA/SPI0_SCK}
    - {id: 4, pin_num: '15', pin_signal: ADC0_SE3/PTA8/I2C0_SCL/SPI0_MOSI}
    - {id: 8, pin_num: '24', pin_signal: PTA2/CMP0_OUT/SWD_DIO}
    - {id: 10, pin_num: '5', pin_signal: EXTAL0/PTA3/I2C0_SCL/I2C0_SDA/LPUART0_TX}
    - {id: 12, pin_num: '6', pin_signal: XTAL0/PTA4/I2C0_SDA/I2C0_SCL/LPUART0_RX/CLKOUT}
pin_labels:
- {pin_num: '3', pin_signal: VDD, label: P3V_MCU}
- {pin_num: '4', pin_signal: VSS, label: GND}
- {pin_num: '5', pin_signal: EXTAL0/PTA3/I2C0_SCL/I2C0_SDA/LPUART0_TX, label: 'PTA3/EXTAL_32KHZ/J4[10]'}
- {pin_num: '6', pin_signal: XTAL0/PTA4/I2C0_SDA/I2C0_SCL/LPUART0_RX/CLKOUT, label: 'PTA4/XTAL_32KHZ/J4[12]'}
- {pin_num: '1', pin_signal: PTB6/IRQ_2/LPTMR0_ALT3/TPM1_CH1/TPM_CLKIN1, label: 'PTB6/J1[8]/J7[2]'}
- {pin_num: '2', pin_signal: PTB7/IRQ_3/TPM1_CH0, label: 'PTB7/J1[12]/J7[4]'}
- {pin_num: '7', pin_signal: PTA5/RTC_CLKIN/TPM0_CH1/SPI0_SS_b, label: 'PTA5/J2[6]/J6[3]/J7[1]'}
- {pin_num: '8', pin_signal: PTA6/TPM0_CH0/SPI0_MISO, label: 'PTA6/J2[10]/J6[5]/J7[5]'}
- {pin_num: '9', pin_signal: PTB10/TPM0_CH1/SPI0_SS_b, label: 'PTB10/J2[2]/J6[2]', identifier: LED_RED}
- {pin_num: '10', pin_signal: PTB11/TPM0_CH0/SPI0_MISO, label: 'PTB11/J2[4]/J5[2]', identifier: LED_GREEN}
- {pin_num: '11', pin_signal: PTA7/IRQ_4/SPI0_MISO/SPI0_MOSI, label: 'PTA7/J2[8]/J6[6]/J7[3]'}
- {pin_num: '12', pin_signal: ADC0_SE9/PTB0/IRQ_5/LLWU_P4/EXTRG_IN/SPI0_SCK/I2C0_SCL, label: 'PTB0/J2[12]/J6[4]/J7[7]', identifier: SW2}
- {pin_num: '13', pin_signal: ADC0_SE8/CMP0_IN3/PTB1/IRQ_6/LPUART0_TX/LPUART0_RX/I2C0_SDA, label: 'PTB1/J1[4]/J5[4]', identifier: DEBUG_UART_TX}
- {pin_num: '14', pin_signal: VREF_OUT/CMP0_IN5/PTB2/IRQ_7/LPUART0_RX/LPUART0_TX, label: 'PTB2/J1[2]/J5[3]', identifier: DEBUG_UART_RX}
- {pin_num: '15', pin_signal: ADC0_SE3/PTA8/I2C0_SCL/SPI0_MOSI, label: 'PTA8/J4[4]/J6[1]', identifier: THER_A}
- {pin_num: '16', pin_signal: ADC0_SE2/PTA9/I2C0_SDA/SPI0_SCK, label: 'PTA9/J4[2]', identifier: THER_B}
- {pin_num: '17', pin_signal: PTB3/IRQ_10/I2C0_SCL/LPUART0_TX, label: 'PTB3/J2[20]/J5[5]/J7[6]', identifier: ACCEL_I2C_SCL}
- {pin_num: '18', pin_signal: PTB4/IRQ_11/I2C0_SDA/LPUART0_RX, label: 'PTB4/J2[18]/J5[6]/J7[8]', identifier: ACCEL_I2C_SDA}
- {pin_num: '19', pin_signal: ADC0_SE1/CMP0_IN1/PTB5/IRQ_12/TPM1_CH1/NMI_b, label: 'PTB5/J1[14]', identifier: SW3}
- {pin_num: '20', pin_signal: ADC0_SE0/CMP0_IN0/PTA12/IRQ_13/LPTMR0_ALT2/TPM1_CH0/TPM_CLKIN0/CLKOUT, label: 'PTA12/J4[6]', identifier: ACCEL_INT}
- {pin_num: '21', pin_signal: PTB13/CLKOUT32K/TPM1_CH1/RTC_CLKOUT, label: 'PTB13/J5[1]', identifier: LED_BLUE}
- {pin_num: '22', pin_signal: ADC0_SE15/CMP0_IN2/PTA0/IRQ_0/LLWU_P7/TPM1_CH0/SWD_CLK, label: 'PTA0/J1[16]', identifier: DEBUG_SWD_SWDCLK}
- {pin_num: '23', pin_signal: PTA1/IRQ_1/LPTMR0_ALT1/TPM_CLKIN0/RESET_b, label: 'PTA1/J3[6]', identifier: SW1}
- {pin_num: '24', pin_signal: PTA2/CMP0_OUT/SWD_DIO, label: 'PTA2/J4[8]', identifier: DEBUG_SWD_SWDIO}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_port.h"
#include "fsl_gpio.h"
#include "pin_mux.h"

